app/Views/master/mposition_v.php

SELECT *
FROM `position`
WHERE `position`.`position_id` != '1'
ORDER BY `position_name` ASC
---
                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("position")
                                        ->where("position.position_id !=","1")
                                        ->orderBy("position_name", "ASC")
                                        ->get();