app/Views/master/muser_v.php

                                    <label class="control-label col-sm-2" for="position_id">Departemen:</label>
                                    <div class="col-sm-10">
                                        <?php
                                        $departemen = $this->db->table("departemen")->orderBy("departemen_name", "ASC")
                                            ->get();
---
SELECT *
FROM `departemen`
ORDER BY `departemen_name` ASC

                                        <select onchange="pph()" class="form-control" id="user_tanggungan" name="user_tanggungan">
                                            <option value="" <?= ($user_tanggungan == "") ? "selected" : ""; ?>>Pilih Status</option>
                                            <?php $tanggungan = $this->db->table("tanggungan")->get();
                                            foreach ($tanggungan->getResult() as $tanggungan) { ?>
---
SELECT *
FROM `tanggungan`

                                </thead>
                                <tbody>
                                    <?php
                                    $usr = $this->db
                                        ->table("user")
                                        ->join("position", "position.position_id=user.position_id", "left")
                                        ->join("departemen", "departemen.departemen_id=user.departemen_id", "left")
                                        ->where("position.position_id !=", "1")
                                        ->orderBy("position_name", "asc")
                                        ->orderBy("user_nik", "asc")
                                        ->get();
---
SELECT *
FROM `user`
LEFT JOIN `position` ON `position`.`position_id`=`user`.`position_id`
LEFT JOIN `departemen` ON `departemen`.`departemen_id`=`user`.`departemen_id`
WHERE `position`.`position_id` != '1'
ORDER BY `position_name` ASC, `user_nik` ASC