app/Views/template/headertop_v.php

                    <?php
                    // $identitypicture=session()->get("identity_logo");
                    $identity_name=session()->get("identity_name");
                    $identity=$this->db->table("identity")->get()->getRow();
---
SELECT *
FROM `identity`