app/Views/login_v.php

$this->db = Database::connect("default");
$icon = "";
$nama = "";
$identity = $this->db->table("identity")->get();
---
SELECT *
FROM `identity`