app/Views/utama_v.php

					->table("user");
				$builder->where("user.user_masuk >=", $from);
				$builder->where("user.user_masuk <=", $to);
				$harian = $builder->get();
---
SELECT *
FROM `user`
WHERE `user`.`user_masuk` >= '2025-04-22'
AND `user`.`user_masuk` <= '2025-04-22'

					->table("user");
				$builder->where("user.user_masuk >=", $from);
				$builder->where("user.user_masuk <=", $to);
				$bulanan = $builder->get();
---
SELECT *
FROM `user`
WHERE `user`.`user_masuk` >= '2025-04-01'
AND `user`.`user_masuk` <= '2025-04-30'

					->table("user");
				$builder->where("user.user_masuk >=", $from);
				$builder->where("user.user_masuk <=", $to);
				$tahunan = $builder->get();
---
SELECT *
FROM `user`
WHERE `user`.`user_masuk` >= '2025-01-01'
AND `user`.`user_masuk` <= '2025-12-31'

					$builder->select("user_masuk");
					$builder->where("user.user_masuk <=", $to);
					$builder->groupBy("user.user_masuk");
					$tahunanroom = $builder->get();
---
SELECT `user_masuk`
FROM `user`
WHERE `user`.`user_masuk` <= '2025-12-31'
GROUP BY `user`.`user_masuk`